Documents/ОткрытиеСезона.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ОткрытиеСезона</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасписаниеЛиги</xr:Item>
				<xr:Item>AccumulationRegister.БюджетыФутбольныхКлубов</xr:Item>
				<xr:Item>InformationRegister.СоставЛиги</xr:Item>
				<xr:Item>InformationRegister.ТрансфернаяСтоимость</xr:Item>
				<xr:Item>InformationRegister.РасстановкаСилНаНачалоСезона</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Лига</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лиги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БюджетыКлубов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФутбольныйКлуб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФутбольныеКлубы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщийБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрансферныйБюджет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрансфернаяСтоимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Футболист</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Футболисты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТрансфернаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставЛиги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФутбольныйКлуб</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФутбольныеКлубы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Лиги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Лиги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СтраныМира</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТрансферноеОкноОткрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МесяцаМатчей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТрансферныеОкна</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ФутбольныеКлубы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ФутбольныеКлубы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИгровыеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тактика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИгровыеТактики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтартовыйСостав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Позиция</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ИгровыеПозиции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Футболист</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Футболисты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Футболисты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Футболисты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФутбольныйКлуб</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФутбольныеКлубы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИгровыеПозиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дриблинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Техника</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидениеПоля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отбор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыборПозиции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скорость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИграБезМяча</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реакция</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИграРуками</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Опека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Удар</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гражданство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОдинНаОдин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейтинг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потенциал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершилКарьеру</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотография</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИнициализацияДанных/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ИнициализироватьДанные() Экспорт

	Если Константы.ДанныеИнициализированы.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	Попытка
		
		ИнициализироватьПервыйСезон();
		
		СгенерироватьНачальныеДанные(); 
		
		Трансферы.СимулироватьТрансфернуюАктивность();
		
		Константы.ДанныеИнициализированы.Установить(Истина);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
        ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
		ОтменитьТранзакцию();
		
	КонецПопытки;
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьПервыйСезон()

	СезонОбъект  = Справочники.Сезоны.Сезон2425.ПолучитьОбъект(); 
	СезонОбъект.ДатаНачала = СтартоваяИгроваяДата();
	СезонОбъект.Записать();

КонецПроцедуры

Процедура СгенерироватьНачальныеДанные()

	НачальныеДанные = ПолучитьОбщийМакет("НачальныеДанные"); 
	JSON = НачальныеДанные.ПолучитьТекст();
	
	СписокФутбольныхЛиг = РаботаСJSON.ЗначениеИзJSON(JSON);
		
	Для Каждого ДанныеЛиги Из СписокФутбольныхЛиг Цикл
		
		Лига = СоздатьЛигу(ДанныеЛиги);
		
		ДокументОткрытияСезона = Документы.ОткрытиеСезона.СоздатьДокумент();
		ДокументОткрытияСезона.Дата = СтартоваяИгроваяДата();
		ДокументОткрытияСезона.Лига = Лига;
		ДокументОткрытияСезона.Сезон = Справочники.Сезоны.Сезон2425;

		Для Каждого ДанныеФутбольногоКлуба Из ДанныеЛиги.ФутбольныеКлубы Цикл
			
			ФутбольныйКлуб = СоздатьФутбольныйКлуб(ДанныеФутбольногоКлуба);		
			
			СтрокаКомандыЛиги = ДокументОткрытияСезона.СоставЛиги.Добавить();
			СтрокаКомандыЛиги.ФутбольныйКлуб = ФутбольныйКлуб;  
			
			СтрокаБюджета = ДокументОткрытияСезона.БюджетыКлубов.Добавить();
			СтрокаБюджета.ФутбольныйКлуб = ФутбольныйКлуб;
			СтрокаБюджета.ОбщийБюджет = ДанныеФутбольногоКлуба.ОбщийБюджет; 
			СтрокаБюджета.ТрансферныйБюджет = ДанныеФутбольногоКлуба.ТрансферныйБюджет;
			
			НомерФотографии = 1;
			Для Каждого ДанныеФутболиста Из ДанныеФутбольногоКлуба.Футболисты Цикл
				
				Если НомерФотографии > 30 Тогда 
					НомерФотографии = 1;
				КонецЕсли;
				
				СоздатьФутболиста(ДанныеФутболиста, ФутбольныйКлуб, НомерФотографии);
				НомерФотографии = НомерФотографии + 1;
				
			КонецЦикла;
						
		КонецЦикла;
		
		ДокументОткрытияСезона.РассчитатьТрансфернуюСтоимостьФутболистов();
		
		ДокументОткрытияСезона.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьЛигу(ДанныеЛиги)

	ЛигаОбъект = Справочники.Лиги.СоздатьЭлемент();
	ЛигаОбъект.Наименование = ДанныеЛиги.Наименование; 
	ЛигаОбъект.Владелец = СтранаПоИмени(ДанныеЛиги.Страна);
	
	Для Каждого МесяцСтрокой Из ДанныеЛиги.МесяцаМатчей Цикл
		СтрокаМесяца = ЛигаОбъект.МесяцаМатчей.Добавить();	
		СтрокаМесяца.Месяц = Дата(МесяцСтрокой);
	КонецЦикла;
	
	Для Каждого ТрансферноеОкно Из ДанныеЛиги.ТрансферныеОкна Цикл
		СтрокаТрансферногоОкна = ЛигаОбъект.ТрансферныеОкна.Добавить();	
		СтрокаТрансферногоОкна.ДатаНачала = Дата(ТрансферноеОкно.ДатаНачала);
		СтрокаТрансферногоОкна.ДатаОкончания = Дата(ТрансферноеОкно.ДатаОкончания);
	КонецЦикла;
	
	ЛигаОбъект.Записать();
	
	Возврат ЛигаОбъект.Ссылка;

КонецФункции

Функция СоздатьФутбольныйКлуб(ДанныеФутбольногоКлуба)

	ФутбольныйКлубОбъект = Справочники.ФутбольныеКлубы.СоздатьЭлемент();
	ФутбольныйКлубОбъект.Наименование = ДанныеФутбольногоКлуба.Наименование;   
	ФутбольныйКлубОбъект.Схема = ВернутьЗначениеПеречисленияПоСинониму("ИгровыеСхемы", ДанныеФутбольногоКлуба.Схема);
	ФутбольныйКлубОбъект.Тактика = ВернутьЗначениеПеречисленияПоСинониму("ИгровыеТактики", ДанныеФутбольногоКлуба.Тактика);
	ФутбольныйКлубОбъект.Страна = СтранаПоИмени(ДанныеФутбольногоКлуба.Страна);
	
	ПозицииПоСхеме = ИгровыеМеханики.ПозицииПоСхеме(ФутбольныйКлубОбъект.Схема);
	
	Для Индекс = 0 По 10 Цикл	
		
		СтрокаСостава = ФутбольныйКлубОбъект.СтартовыйСостав.Добавить();
		
		GUIDИгрокаСтартовогоСостава = ДанныеФутбольногоКлуба.СтартовыйСостав[Индекс];
		СтрокаСостава.Футболист = Справочники.Футболисты.ПолучитьСсылку(Новый УникальныйИдентификатор(GUIDИгрокаСтартовогоСостава));   
		
		СтрокаСостава.Позиция = ПозицииПоСхеме[Индекс];
		
	КонецЦикла;
	
	ФутбольныйКлубОбъект.Записать();
	
	Возврат ФутбольныйКлубОбъект.Ссылка;

КонецФункции

Функция СоздатьФутболиста(ДанныеФутболиста, ФутбольныйКлуб, НомерФотографии)

	ФутболистОбъект = Справочники.Футболисты.СоздатьЭлемент();     
	ФутболистОбъект.УстановитьСсылкуНового(Справочники.Футболисты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДанныеФутболиста.GUID)));
	ЗаполнитьЗначенияСвойств(ФутболистОбъект, ДанныеФутболиста);   
	ФутболистОбъект.ФутбольныйКлуб = ФутбольныйКлуб;
	ФутболистОбъект.Позиция = ВернутьЗначениеПеречисленияПоСинониму("ИгровыеПозиции", ДанныеФутболиста.Позиция); 
	ФутболистОбъект.Гражданство = Справочники.СтраныМира.Россия;
	ФутболистОбъект.Фотография = Новый ХранилищеЗначения(БиблиотекаКартинок["ФотоФутболиста" + НомерФотографии]);
	
	ФутболистОбъект.Записать();
	
	Возврат ФутболистОбъект.Ссылка;

КонецФункции 

Функция СтранаПоИмени(НаименованиеСтраны)

	Страна = Справочники.СтраныМира.НайтиПоНаименованию(НаименованиеСтраны);
	Если ЗначениеЗаполнено(Страна) Тогда
		Возврат Страна;
	КонецЕсли;
	
	СтранаОбъект = Справочники.СтраныМира.СоздатьЭлемент();
	СтранаОбъект.Наименование = НаименованиеСтраны; 
	СтранаОбъект.Записать();
	
	Возврат СтранаОбъект.Ссылка;

КонецФункции 

Функция ВернутьЗначениеПеречисленияПоСинониму(ИмяПеречисления, СинонимЗначения)
	
	ЭлементПеречисления = Неопределено;
	Для каждого ТекЭлемент Из Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления Цикл
		Если ТекЭлемент.Синоним = СинонимЗначения Тогда
			ЭлементПеречисления = Перечисления[ИмяПеречисления][ТекЭлемент.Имя];
			Прервать;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ЭлементПеречисления;
	
КонецФункции

Функция СтартоваяИгроваяДата()

	Возврат '20240101';

КонецФункции 

#КонецОбласти
